IDEA Open Model
CssComponent Class
Compatible with IDEA StatiCa 20.1
 One component of cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.CssComponent
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class CssComponent : OpenObject
Public Class CssComponent
	Inherits OpenObject
The CssComponent type exposes the following members.
Constructors
Name | Description
CssComponent
Initializes a new instance of the CssComponent class
Top
Properties
Name | Description
Geometry
 Geometry
Id
 Component Id
Material
 Material
Phase
 Phase
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace